{
  "projects": [
    {
      "title": "BCHJam",
      "description": "Neuro controller for live music performance in shared Mixed Reality environments.",
      "fullDescription": "BCHJam is a neuro controller for live music performance in shared Mixed Reality environments. The musician, equipped with a BCI, can use brain input to activate effects and control the music in real-time. Alpha and beta waves generate visual effects visible to the audience using mixed reality headsets. This project explores the possibilities of using BCI in live music performances to create a new form of artistic expression.",
      "image": "assets/images/webp/bchjam.webp",
      "tags": [
        "BCI",
        "Machine Learning",
        "Unity",
        "Mixed Reality",
        "Music"
      ],
      "award": "1st Place - BR41N.IO 2024",
      "year": "2024",
      "github": "https://github.com/BRomans/BCHJam",
      "paper": "https://ieeexplore.ieee.org/document/10704087",
      "video": "https://www.youtube.com/watch?v=aIUvgyed3MQ"
    },
    {
      "title": "NervCon",
      "description": "Powerful overlay controller integrating BCI technology with games.",
      "fullDescription": "NervCon is a powerful overlay controller designed to seamlessly integrate Brain-Computer Interface (BCI) technology with your favourite games. This innovative controller allows users to control games using their brain signals, making gaming more immersive and accessible. Built as an overlay application with drag-and-drop customizable interface for connecting your mind to the gaming experience.",
      "image": "assets/projects/NervCon/nervcon.png",
      "tags": [
        "BCI",
        "Unity",
        "Video Game",
        "Machine Learning",
        "C#"
      ],
      "award": "1st Place - NTX Global Hackathon 2023",
      "year": "2023",
      "github": "https://github.com/unicorn-bi/NervCon"
    },
    {
      "title": "P.E.R.S.O.N.A.",
      "description": "AI for artistic expression of human empathy.",
      "fullDescription": "P.E.R.S.O.N.A. is an AI created for artistic expression of human empathy. A participatory experience of an interactive reinforcement learning model that learns to communicate with humans through facial expressions and proximity sensors. The AI evolves its behavior based on human interaction patterns.",
      "image": "assets/images/webp/poster.webp",
      "tags": [
        "AI",
        "Machine Learning",
        "Unreal Engine",
        "Arduino",
        "Art"
      ],
      "award": "3rd Place - CREARTATHON 2021",
      "year": "2021",
      "github": "https://github.com/BRomans/PERSONA"
    },
    {
      "title": "Deep Harbour",
      "description": "Dynamic pricing platform for container logistics using LSTM networks.",
      "fullDescription": "Deep Harbour is a platform for cargo owners, freight forwarders and transportation companies to efficiently handle container flow by adjusting prices of supply/demand using Dynamic Pricing. The model is based on LSTM networks fed with prediction of peaks from historical data.",
      "image": "assets/projects/DeepHarbor/deep_harbor.png",
      "tags": [
        "Deep Learning",
        "Deep Learning",
        "Python",
        "Logistics"
      ],
      "award": "2nd Place - EIT Digital DeepHack 2020",
      "year": "2020"
    },
    {
      "title": "Brain Hockey",
      "description": "Pong game controlled by brain signals through neurofeedback.",
      "fullDescription": "BrainHockey is an innovative take on the beloved Pong game, where players use their brainpower to control the paddle instead of traditional inputs. Players move their paddle by focusing and concentrating on Neurofeedback Targets.",
      "image": "assets/images/webp/brain_hockey.webp",
      "tags": [
        "BCI",
        "Unity",
        "EEG",
        "Video Game",
        "Neurofeedback",
        "P300"
      ],
      "year": "2024",
      "github": "https://github.com/BRomans/BrainHockey"
    },
    {
      "title": "The Green Shield",
      "description": "Space Invaders with BCI-controlled barriers in VR.",
      "fullDescription": "A revisited version of Space Invaders where the player uses a BCI to create barriers and stop the alien invasion. Developed for G.Tec Unicorn devices, playable on PC or Meta Quest VR.",
      "image": "assets/images/webp/green_shield.webp",
      "tags": [
        "BCI",
        "Unity",
        "VR",
        "Video Game",
        "EEG",
        "P300"
      ],
      "year": "2023",
      "github": "https://github.com/BRomans/TheGreenShield"
    },
    {
      "title": "FLOWer",
      "description": "Redesigned P300 speller with flower-based interface.",
      "fullDescription": "A revisited design of the classic P300 speller that improves accuracy through CNN analysis, UX through intuitive flower interface, and ITR using NLP/LLM for predictive adaptive interface.",
      "image": "assets/images/webp/flower.webp",
      "tags": [
        "BCI",
        "Machine Learning",
        "Python",
        "Figma",
        "P300"
      ],
      "year": "2023",
      "github": "https://github.com/BRomans/FLOWer",
      "demo": "https://www.figma.com/proto/qRgislCXYSYOzEXIEh3Nli/P300-FLOWer"
    },
    {
      "title": "Music-Emotion",
      "description": "Real-time emotion recognition from EEG during music listening.",
      "fullDescription": "Pipeline to process and classify emotional valence and arousal in brain activity of users listening to music. Proof of concept for emotion-based music recommendation systems.",
      "image": "assets/projects/Music-Emotion/me.jpg",
      "tags": [
        "Machine Learning",
        "EEG",
        "Python",
        "Signal Processing"
      ],
      "year": "2021",
      "github": "https://github.com/BRomans/EmotionMusic-Classification"
    },
    {
      "title": "Doc-Hoc",
      "description": "Concept for a BCI-powered language learning assistant.",
      "fullDescription": "Doc-Hoc is a concept for a BCI-powered assistant for language learning based on the OpenBCI ecosystem and designed during the BR41N.IO 2022 hackathon. The idea behind Doc-Hoc is to provide analytics on the level of relaxation and concentration to help the students organising their study and avoid stressful sessions",
      "image": "assets/projects/DocHoc/dochoc.png",
      "tags": [
        "Figma",
        "BCI",
        "Deep Learning"
      ],
      "year": "2022",
      "demo": "https://www.figma.com/proto/KsBJaYG34b2OvpPREIYYTZ/BCI-Learning-Assistant?node-id=0-1&t=KwMSs1p3PNl4O09K-1"
    },
    {
      "title": "Mindworms",
      "description": "Worms-like game where attack power is modulated by brain activity.",
      "fullDescription": "Mindworms is a Worms-like game in Unity showcasing brain activity as game input. The power of player attacks is modulated by the sensorimotor rhythm of the players.",
      "image": "assets/projects/Mindworms/mindworms.png",
      "tags": [
        "BCI",
        "Unity",
        "Video Game",
        "EEG",
        "Machine Learning"
      ],
      "year": "2021",
      "github": "https://github.com/BRomans/advanced-project-bci"
    },
    {
      "title": "Amuleto",
      "description": "Sincere Pill Dispenser for home care.",
      "fullDescription": "Amuleto is a sincere and courageous pill dispenser designed to create an experience that helps patients cope with their diagnosis, both from the social and health perspectives. The project was the outcome of a Multisensory Design process that aimed at including multiple human senses in the design of a product.",
      "image": "assets/projects/amuleto/3d_render_1.jpg",
      "tags": [
        "Unreal Engine",
        "Illustrator",
        "Figma"
      ],
      "year": "2020",
      "demo": "https://drive.google.com/file/d/1kMdBxILoV84EiW2eQiLBE7yBGL8B4ehl/view?usp=share_link"
    },
    {
      "title": "Exhibition of a Lifetime",
      "description": "Mixed reality application for music composition and mixing.",
      "fullDescription": "Exhibition of a Lifetime is a VR art gallery where spectators are driven through a visual and audio experience that represents the four phases of life: childhood, youth, adulthood and seniority. The goal of the project was to explore innovative ways for people to interact with art pieces",
      "image": "assets/projects/exhibition/home.png",
      "tags": [
        "Unity",
        "Mixed Reality",
        "VR",
        "Art"
      ],
      "year": "2020",
      "github": "https://github.com/BRomans/EIT_Innovation_Entrepreneurship_Advanced"
    },
    {
      "title": "Gamerly",
      "description": "Platform for game developers to find coaching and peers.",
      "fullDescription": "Gamerly is a platform for game developers to find coaching and other peers to work with on new game projects. We designed Gamerly as a challenge to innovate the market of game development by adding a networking component to build new teams and  with the possibility of requesting coaching from senior members of the community.",
      "image": "assets/projects/Gamerly/Find Collaborators.png",
      "tags": [
        "Figma",
        "Design"
      ],
      "year": "2020",
      "demo": "https://www.figma.com/proto/9pKoLEID40oIuTLY60neiS/Gamerly?node-id=269%3A2465"
    },
    {
      "title": "XR Music Lab",
      "description": "Mixed reality application for music composition and mixing.",
      "fullDescription": "Creative application for mixing music using VR and AR. In VR, players learn music composition with totem beats. In AR, players use an augmented console with Leap Motion to transpose hands into virtual environment.",
      "image": "assets/images/webp/xrmusiclab.webp",
      "tags": [
        "Mixed Reality",
        "Unity",
        "Music",
        "Leap Motion"
      ],
      "year": "2020",
      "github": "https://github.com/BRomans/EIT_XR_Music_Lab",
      "video": "https://drive.google.com/file/d/13y2jOSAXh6gAugM7NgERDsjK58k1Fjg-/view"
    },
    {
      "title": "Turkey Jump!",
      "description": "Flappy Bird clone controlled by voice volume in a space-themed environment.",
      "fullDescription": "Turkey Jump! is a 2D platformer game developed in Unity, as part of a study on alternative input methods for videogames. The game is a clone of the famous and unforgiving Flappy Bird, but instead of touch pressure, the jumps of the turkey Kevin are triggered using the volume of the player's voice.",
      "image": "assets/projects/TurkeyJump!/turkey_jump.png",
      "tags": [
        "Unity",
        "Video Game"
      ],
      "year": "2019",
      "github": "https://github.com/BRomans/EIT_voice_arcade"
    },
    {
      "title": "IOT Vulnerability",
      "description": "Analysis tool to find vulnerable IOT devices using Shodan search engine and visualize them on the ELK stack.",
      "fullDescription": "We developed an analysis tool to find vulnerable IOT devices using the Shodan search engine and visualize them on the ELK stack with several combination of metrics. The pipeline has been automated using Apache NiFi.",
      "image": "assets/projects/IOT Vulnerability/home.png",
      "tags": [
        "Security",
        "IOT",
        "Webapp"
      ],
      "year": "2018",
      "github": "https://github.com/BRomans/IoTVulnerabilityAnalysis"
    },
    {
      "title": "RoadBuddy",
      "description": "Android app for bikers to organize trips together with shared routes and stops.",
      "fullDescription": "RoadBuddy is an app that we designed and developed for bikers to organize their trips together. Based on the Google Maps API, the core idea is to share a trip and stops for a group of people driving together on different vehicles.",
      "image": "assets/projects/RoadBuddy/road_buddy.png",
      "tags": [
        "Android",
        "Mobile App",
        "Java"
      ],
      "year": "2016",
      "video": "https://www.youtube.com/watch?v=84H-o9Ggkzw",
      "github": "https://github.com/BRomans/RoadBuddy-1"
    },
    {
      "title": "Throw Away",
      "description": "Interactive tangible serious game prototype to teach children proper waste recycling.",
      "fullDescription": "ThrowAway is a design prototype of an interactive tangible serious game to teach children how to properly recycle waste.",
      "image": "assets/projects/ThrowAway/home.png",
      "tags": [
        "Design",
        "Illustrator",
        "Serious Game",
        "Education"
      ],
      "year": "2015",
      "demo": "https://drive.google.com/file/d/0B5kGqHe0yw4aQVJpQloyTnlyN00/view?usp=share_link&resourcekey=0-pVqCCcI6ne-OMiYY5qGaIQ",
      "video": "https://drive.google.com/file/d/1JY8O8y0TIHXOtlG9NXQpt8kGplwB67EI/view?usp=share_link"
    }
  ]
}